#!/usr/bin/env pwsh

#========================================================================
# システムクリップボードのテキストでメールを作成
#========================================================================

#========================================================================
# Thunderbirdアプリケーションパス
#========================================================================
$mailer='C:\Program Files\Mozilla Thunderbird\thunderbird.exe'

#========================================================================
# 本文の上限サイズ（バイト数）
#========================================================================
$bodysizelimit = 32000

#========================================================================
# 宛先とサブジェクト
#========================================================================
$to=$env:DEFAULT_TO_EMAIL
$title="Windowsシステムクリップボード"

#========================================================================
# システムクリップボードのテキストをThunderbirdのコンポーザに貼り付け
# できるフォーマットへ変換
#========================================================================
$body=$(Get-Clipboard | Out-String)

$body=$body -replace " ","&nbsp;"
$body=$body -replace "<","&lt;"
$body=$body -replace ">","&gt;"

#========================================================================
# 引数で指定できる文字列長には上限がある。上限を超えている場合には、条件
# 未満まで文字列を減らして使用する。
#========================================================================
if ($body.Length -gt $bodysizelimit) {
	$i = 1
	while ($true) {
		$subbody = $body.Substring(0, $i)
		if ($subbody.Length -gt $bodysizelimit) {
			break;
		}
		$i++
	}

	if ($i -gt 1) {
		$body = $body.Substring(0, $i - 1)
	}
	else {
		$body='テキストデータが大きすぎて使えません'
	}
}

#========================================================================
# メールを作成
#========================================================================
& $mailer 								`
        -compose 							`
        "to='$to',subject='$title',body='$body'"
