#!/usr/bin/env pwsh

#========================================================================
# スクリーンショットを取得する
#========================================================================

#========================================================================
# 引数を処理
#   -URI uri		スクリーンショットを取得するリソースのURI
#   -Width width	スクリーンショットの幅
#   -Height height	スクリーンショットの高さ
#========================================================================
Param(
	[Parameter(Mandatory=$false)][String]$URI = "desktop:",
	[Int]$Width = 1200,
	[Int]$Height = 800
)

#========================================================================
# デフォルトのスクリーンショットファイル
#========================================================================
$outfile="${env:HOME}/ss.png"

#========================================================================
# スクリーンショットの取得に利用するアプリケーション
#========================================================================
$msedge='C:\Program Files (x86)\Microsoft\Edge\Application\msedge.exe'
$snippingtool='SnippingTool.exe'

#========================================================================
# どの方法でスクリーンショットを取得するか判断
#========================================================================
switch	-Wildcard ($URI)
{
	'http*'
	{
		#========================================================
		# Microsoft Edgeを使って取得
		#========================================================
		$method='msedge'
		break
	}

	'desktop:*'
	{
		#========================================================
		# Snipping Toolを使って取得
		#========================================================
		$method='snippingtool'
		break
	}
}

#========================================================================
# スクリーンショットを取得
#========================================================================
switch ($method)
{
	#================================================================
	# Microsoft Edgeを使って取得
	#================================================================
	'msedge'
	{
		$o1='--headless'
		$o2='--screenshot="' + ${outfile} + '"'
		$o3="--window-size=${Width},${Height}"

		Start-Process	-FilePath $msedge			`
				-ArgumentList $o1,$o2,$o3,$URI		`
				-Wait
		break
	}

	#================================================================
	# Snipping Toolを使って取得
	#================================================================
	'snippingtool'
	{
		Start-Process	-FilePath $snippingtool	
		# ※ -Waitは指定しても機能しない
		break
	}
}
