#!/usr/bin/env pwsh

#========================================================================
# URLで指定されたリソースを取得
#========================================================================

#========================================================================
# 引数を処理
#   -URL url		WebリソースのURL
#========================================================================
Param(
	[Parameter(Mandatory=$true)][String]$URL = ""
)

#========================================================================
# Webページの読み込みおよびレンダリング待機時間
#========================================================================
$WTime = 5
switch  -Wildcard ($URL)
{
	# Check PointはJavaScriptで処理を行う必要があるほか、CAPTCHAを
	# 使って人間であるかの判定を行うため、その判定用の時間を設けて
	# おく。
	'https://blog.checkpoint.com/*' {
		$WTime = 20
		break
	}
}

#========================================================================
# Webリソースを取得
#========================================================================
# Microsoft Edge WebDriverを起動
webdriver_edge_start.ps1					> $null

# WebDriver経由でURLをオープン
Set-SeUrl	-Url $URL

# ページ読み込みとレンダリングが完了するまで待機
Start-Sleep	$WTime

# HTMLを取得して出力
Get-SeHtml

# Microsoft Edge WebDriverを終了
webdriver_edge_stop.ps1						> $null
