#!/usr/bin/env pwsh

#========================================================================
# URLで指定されたリソースを取得
#========================================================================

#========================================================================
# 引数を処理
#   -URL url		WebリソースのURL
#========================================================================
Param(
	[Parameter(Mandatory=$true)][String]$URL = ""
)

#========================================================================
# Webリソースを取得
#========================================================================
# Microsoft Edge WebDriverを起動
webdriver_edge_start.ps1

# WebDriver経由でURLをオープン
Set-SeUrl	-Url $URL

# ページ読み込みとレンダリングが完了するまで待機
Start-Sleep	5

# HTMLを取得して出力
Get-SeHtml

# Microsoft Edge WebDriverを終了
webdriver_edge_stop.ps1
