#
# 特定のファイルに書き込まれたコマンドを実行する簡易サーバ
#

#========================================================================
# コマンドが書き込まれるファイル
#========================================================================
$commandFilePath = "${HOME}/.wincmdserver_cmd"

#========================================================================
# ファイルをチェックするインターバル時間[秒]
#========================================================================
$commandFileCheckInterval = 1.0

#========================================================================
# コマンドが書き込まれるファイルを監視して、コマンドが書き込まれた場合には
# コマンドを実行してファイルをクリアする。
#========================================================================
while ($true) {
    # ファイルが存在し、かつ、中身があるときに処理を行う
    if (Test-Path "$commandFilePath") {

        if (0 -lt (Get-ChildItem "$commandFilePath").Length) {

            # ログ出力
            $timestamp = Get-Date -format "yyyy/MM/dd HH:mm:ss"
            $timestamp + " - " + (cat "$commandFilePath")

            # ファイルに書き込まれたコマンドを実行
            Invoke-Expression (cat "$commandFilePath") 

            # ファイルの中身をクリア
            Clear-Content "$commandFilePath"
        }
    }

    # 次のチェックまで指定秒間待機
    Start-Sleep $commandFileCheckInterval
}
